<template>
  <q-page-container>
    <h3></h3>
    <q-page class="q-pa-xs" style="max-width: 1200px; margin: 0 auto">
      <h3 class="row q-mb-md">Что такое Корпус русских учебных текстов?</h3>
      <q-card flat bordered class="rounded-borders q-mb-xs">
        <q-card-section class="row items-center">
          <span class="info-value" id="main-text">
            Корпус русских учебных текстов (КРУТ) – это коллекция текстов на
            русском языке, написанных студентами разных вузов. Общий объем
            корпуса составляет около 3,1 млн. слов. Тексты сопровождаются
            несколькими типами разметки (метатекстовой, морфологической
            разметкой и разметкой по ошибкам), что позволяет осуществлять поиск
            по корпусу. Корпус русских учебных текстов является
            информационно-справочной системой, предназначенной для
            исследователей, преподавателей, студентов, а также для всех, кто
            интересуется проблемами современной русской грамматики, актуальными
            процессами в области лексики, морфологии и синтаксиса современного
            русского языка.
          </span>
        </q-card-section>
      </q-card>
      <h3 class="row q-mb-md">Как искать?</h3>
      <q-card flat bordered class="rounded-borders q-mb-xs">
        <q-card-section class="row items-center">
          <h4 class="q-mt-sm q-mb-md">Как найти словоформу в корпусе?</h4>
          <span class="info-value">
            В окне поиска в строке «Поиск точных форм» наберите нужную
            словоформу и щелкните на кнопке «Поиск».
          </span>
          <h4 class="q-mt-md q-mb-md">
            Что такое лексико-грамматический поиск?
          </h4>
          <span class="info-value">
            Лексико-грамматический поиск позволяет искать все вхождения лексемы,
            вхождения лексемы в нужной грамматической форме, необходимые тэги
            ошибок, а так же позволяет искать сочетания нескольких слов. Чтобы
            найти все вхождения конкретной лексемы в корпус, на странице поиска
            в зоне «Лексико-грамматический поиск» в поле «Словоформа» наберите
            нужное слово и щелкните на кнопке «Поиск» (лексему нужно набирать в
            основной, словарной форме). В ответ на этот запрос Вы получите все
            словоформы, относящиеся к лексеме и входящие в Корпус.
          </span>
          <h4 class="q-mt-md q-mb-md">Расстояние между словами</h4>
          <span class="info-value">
            В графе «Расстояние» устанавливается нужное расстояние от первого
            слова до всех следующих. Например, расстояние 1–1 означает, что
            слово будет непосредственно справа от первого слова поиска,
            расстояние 1–2 – слово будет справа рядом или справа через одно
            слово, 2–2 – слово будет справа через одно слово от первого.
            Расстояние может быть отрицательным (например, -1 и -2). Если Вы
            ищете последовательность из трех слов, то в первой графе
            "Расстояние" нужно задать параметры 1-1, а во второй 2-2.
          </span>
        </q-card-section>
      </q-card>
      <h3 class="row q-mb-md">Как размечать?</h3>
      <q-card flat bordered class="rounded-borders q-mb-xs">
        <q-card-section class="row items-center">
          <h4 class="q-mt-sm q-mb-md">Начало работы</h4>
          <span class="info-value">
            Чтобы приступить к разметке в корпусе RLC необходимо: 1) Зайти на
            сайт под своим логином, кликнув на портрет в верхнем правом углу и
            заполнив поля логин/пароль в появившемся окне. 2) Перейти в раздел
            “Аннотировать” и выбрать текст в нужном разделе. Первый номер перед
            названием текста означает его порядковый номер в данном разделе,
            второй номер – уникальный номер в базе данных.
          </span>
        </q-card-section>
      </q-card>
    </q-page>
  </q-page-container>
</template>

<style>
.info-value {
  font-size: 16px;
  white-space: pre-line;
}
</style>
